### Plan for production
🟡 Modify module.event_sourcing.module.table["AbTestChangeEvent"].snowflake_table.this
🟡 Modify module.event_sourcing.module.table["AbTestParticipantAllocationEvent"].snowflake_table.this
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**0 to add, 2 to modify, 3 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "4518658587775495218" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T19:05:15Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "3492873484387198161" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T19:05:15Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing:16" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.18-89" -> "0.0.20-93"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (6 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.18-89" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.20-93"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.18-89" -> "0.0.20-93"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.18-89" -> "0.0.20-93"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.event_sourcing.module.table["AbTestChangeEvent"].snowflake_table.this will be updated in-place
  ~ resource "snowflake_table" "this" {
        id                  = "RAW|AUTOMOTIVE|AB_TESTING_ABTESTCHANGEEVENT"
        name                = "AB_TESTING_ABTESTCHANGEEVENT"
        # (7 unchanged attributes hidden)

      ~ column {
          ~ name     = "TEST_ID" -> "PARTICIPANT_ID"
            # (2 unchanged attributes hidden)
        }
      ~ column {
          ~ name     = "TEST_VERSION" -> "RESOURCE_VERSION"
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.event_sourcing.module.table["AbTestParticipantAllocationEvent"].snowflake_table.this will be updated in-place
  ~ resource "snowflake_table" "this" {
        id                  = "RAW|AUTOMOTIVE|AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT"
        name                = "AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT"
        # (7 unchanged attributes hidden)

      ~ column {
          ~ name     = "PARTICIPANT_VERSION" -> "RESOURCE_VERSION"
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: production.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "production.plan"

```
</details>